documentation/how_to_model_a_study.md
```mermaid
---
title: Study
---
flowchart LR
    di[(Data In)] -- data --> d1[Discipline 1]
    subgraph ExecutionEngine
      d1 -- data --> d2[Discipline 2]
      d2 -- data --> ddots([...])
      ddots -- data --> dn[Discipline N]
    end
    dn -- data --> do[(Data Out)]
```
