documentation/how_to_model_a_study.md
```mermaid
flowchart LR
  di1([ ])
  di2([ ])
  subgraph ExecutionEngine
    d1[Discipline 1]
    d2[Discipline 2]
    d3[Discipline 3]
  end
  do1([ ])
  do2([ ])

  di1-->d1
  d1-->d2
  di2-->d3
  d3-->d2
  d2-->do1
  d3-->do2
```
